<?php
// Функция за връзка със сървър.
function dbConnection() {
    // Декларираме променливи, чиито стойности ще са данните осъществяващи връзката със сървъра.
    $dbHost = "localhost";
    $dbUser = "root";
    $dbPass = "";
    $dbName = "course";
    global $connection;
    // Осъществяваме конекцията.
    $connection = mysqli_connect($dbHost, $dbUser, $dbPass, $dbName);
    // Ако нямя осъществена конекция по някаква причина показваме error message.
    if (!$connection){
        /* Не е добре да казвате на потребителя, точно какво се случва на сайта Ви.
        |  Заради това оставете семпло съобщение.
        */
        die("Нещо се обърка!!! Опитайте малко по-късно.".mysqli_error());
        /* Може да подадем и грешка, използвайки error_log(), където чрез email
         | да уведомим себеси или администратора, че е възникнал проблем с
         | връзката към сървъра.
         */
        // error_log("Нещо се обърка!!! Опитайте малко по-късно. ", 1, "operator@example.com");
    }
    // Ако връзката е осъществена и работи пускаме контролно съобщение. То е само за наша информация.
    // Това съобщение е добре да се закоментира след, като разберете, че конекцията е извършена успешно.
    echo "<span class='green'>Успешно свързване със сървъра!!!</span>"."<hr/>";
    /* Ако искаме да създадем база от данни направо през php скрипта
       използжаме кода от долу и сложете име по ваш избор.
    */
    $sql = 'CREATE DATABASE dbname';
    if (mysqli_query($connection, $sql)) {
        echo "Успешно създаване на база с данни";
    } else {
        echo 'База от данни с това име е вече създадена'."<hr />";
    }
    // Затваряне на предишно отворени канекции, когато php сцрипта се изпълни. Силно препоръчително действие.
//    mysqli_close($connection);
}
// Накрая извикваме функцията тук или във всеки файл, в който ще използваме конекцията.
dbConnection();

?>
