<?php

    // Функция за връзка със сървър.
    function dbConnection() {

        $dbHost = "localhost";
        $dbUser = "root";
        $dbPass = "";
        $dbName = "course";

        $connection = mysqli_connect($dbHost, $dbUser, $dbPass, $dbName);

        if (!$connection){
            /* Не е добре да казвате на потребителя, точно какво се случва на сайта Ви.
            |  Заради това оставете семпло съобщение.
            */
            die("Нещо се обърка!!! Опитайте малко по-късно. ". mysqli_error());

            /* Може да подадем и грешка, използвайки error_log(), където чрез email
             | да уведомим себеси или администратора, че е възникнал проблем с
             | връзката към сървъра.
             */
            // error_log("Нещо се обърка!!! Опитайте малко по-късно. ", 1, "operator@example.com");
        }
        echo "Успешно свързване със сървъра"."<hr/>"; // Това съобщение е добре да се закоментира след, като разберете, че конекцията е извършена успешно.
        mysqli_close($connection);

    }

    // Накрая извикваме функцията тук или във всеки файл, в който ще използваме конекцията.
    dbConnection();
