<?php

/* Към променливата $stmt прикачаме променливата, която държи връзката с базата данни.
*  Използваме prepare statement за да подготвим данните за изпращане и запис.
 * Обърнете внимание, че ключовете не ги подаваме като стринг. Това е с цел секюрити.
 * Във велю се очакват данни без да опуменаваме от какъв тип ще са. Използваме толкова
 * въпросителни колкото данни вписани в инпут полета имаме намерение да използваме.
*/
$stmt = $connection->prepare("INSERT INTO users (username, useremail, phone, password) VALUES (?, ?, ?, ?)");

// Правим проверка дали се осъществила връзката
if($stmt){

    // Ако се е осъществила връзка използваме метода bind_param.
    // Първото нещо е да укажем с s, че ще използваме стринг /4 s = 4 стринга /.
    // След това подаваме променливите, които предварително сме дефинирали и използвали в validation.php
    $stmt->bind_param("ssss", $valUserName, $valUserEmail, $valUserPhone, $valUserPass);

    // На финала казваме на скрипта да се изпълни.
    $stmt->execute();

    // Ако всичко е преминало добре пускаме успешно съобщение.
    echo "Записът  е изпълнен успешно";

}
else {
    // Ако не се е записала информацията пускаме съобщение за грешка.
    echo "Нещо се обърка. Опитайте отново";
}

?>
