<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8"/>
	<title>Логически оператори | Logical operators</title>
</head>
<body>
	<?php

		$a = 5;
		$b = 10;
		$c = 30;
		$d = 20;

		// Логическо "И" && - трябва и двете условия да са изпълнени за да бъде вярен резултатът.
		if($a < $b && $c > $d) {
			echo "И двете условия са изпълнени и вярни!!!"."<br />";
		}
		else {
			echo "Накое от двете условия не е изпълнено или е невярно!!!"."<br />";
		}

		$e = 100;
		$f = 1000;
		$g = 390; 
		$h = 500; 

		// Логическо "ИЛИ" || - трябва едното от двете условия да бъде изпълнено за да бъде вярен резултатът.
		if($e > $f || $g < 500) {
			echo "Едното от условията е изпълнено значи изразът е вярен!!!"."<br />";
		}
		else {
			echo "Накое от двете условия не е изпълнено вярно, тоест израза е невярен!!!"."<br />";
		}

		// Логическо отрицание !
		$i = 20;
		if( !$i ) {
			echo "Не съществува такава променлива, значи изразът е верен!!!"."<br />";
		}
		else {
			echo "Съществува такава променлива, значи изразъте е грешен!!!"."<br />";
		}
	?>
</body>
</html>
