<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8"/>
	<title>Цикли | Loops</title>
</head>
<body>
	<?php
		/* For Loop
		======================================*/

		// Отпечатване на числата от едно до сто.
		// $i = 1 - Инициализираме променлива, която казва от кога ще започне да върти цикълът.
		// Поставяме условие, до кога ще се върти/изпълнява цикълът $i <= 100;.
		// Инкрементираме променливата с единица за да се изпълни условието за край на цикъла $i++.
		for ($i = 1; $i <= 100; $i++) { 
			// В тялото на цикъла поставяме код за изпълнение echo $i."<br />";. 
			/* На всяка интерация кръг от цикъла ще печатим стойноста на $i, 
			като на първия кръг ще е едно, на втория две и тн. $i променя стойноста си при инкремент.
			Инкремент на $i се извършва като последна операция, първо изеършва всички други операции. */
			echo $i."<br />";
		}

		/*	While loop
		======================================*/
		// Отпечатване на числата от едно до сто.
		// $j = 1 - Инициализираме променлива, която казва от кога ще започне да върти цикълът.
		$j = 1; 
		// Поставяме условие, до кога ще се върти/изпълнява цикълът $j <= 100;.
		while ( $j <= 100) {
			// В тялото на цикъла поставяме код за изпълнение echo $j."<br />";.
			echo $j."<br />";
			// Инкрементираме променливата с единица за да се изпълни условието за край на цикъла $j++.
			$j++; // Или $j = $j + 1;
		}
		
		/* Do while loop
		======================================*/
		// Отпечатване на числата от едно до сто.
		//$r = 1; - Инициализираме променлива, която казва от кога ще започне да върти цикълът.
		$r = 1;
		// Задаваме стойността за отпечатване и след това инкрементираме.
		do {
			// В тялото на цикъла поставяме код за изпълнение echo $r."<br />";.
			echo $r."<br />";
			// Инкрементираме променливата с единица за да се изпълни условието за край на цикъла $r++.
			$r++;
		}
		while($r <= 100); // Поставяме условие, до кога ще се върти/изпълнява цикълът $r <= 100;

		/*	Foreach loop
		======================================*/
		$cars = array(
			"Bmw",
			"Mercedes",
			"VW",
			"Mazda",
			"Renault"
		);

		/* За всяка стойност на масивът $cars която притежава ключ $key да дай стойноста $value.
		
		foreach ($variable as $key => $value) {
			# code...
		}
		
		*/

		foreach ($cars as $key => $car) {
			echo $car."<br />";
		}
	?>
</body>
</html>
