<!DOCTYPE html>
<html>
<head>
	<meta charset="UTF-8"/>
	<title>Цикли | Loops</title>
</head>
<body>
	<?php
		/* For Loop
		======================================*/

		// Отпечатване на числата от едно до сто.
		// $i = 1 - Инициализираме променлива, която казва от кога ще започне да върти цикълът.
		// Поставяме условие, до кога ще се върти/изпълнява цикълът.
		// Инкрементираме променливата с единица за да се изпълни условието за край на цикъла.
		for ($i = 1; $i <= 100; $i++) { 
			// В тялото на цикъла поставяме код за изпълнение. 
			/* На всяка интерация кръг от цикъла ще печатим стойноста на i, 
			като на първия кръг ще е едно, на втория две и тн. */
			echo i."<br />";
		}
	?>
</body>
</html>
